Q1

Database:
         Database is used to store the information by means of a table or any other type of format. 
SQL:
    SQL(Structured Query Language) is a programming language used to store tables files and some structured type of information in database 
NoSQL:
      NoSQL is used to store multiple type of information like images, videos, gifs, etc along with textfiles, tables.

Q2

DDL stands for Data Definition Language, and it is a subset of SQL (Structured Query Language) used to define and manage the structure of a database. DDL statements are used to create, modify, and delete database objects such as tables, indexes, and views.

Here are explanations and examples of the commonly used DDL statements:

CREATE: The CREATE statement is used to create new database objects such as tables, views, indexes, or even entire databases. It defines the structure of the object along with its attributes. Here's an example of creating a table:

In [ ]:
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10,2)
);

DROP: The DROP statement is used to delete existing database objects such as tables, views, or indexes. It permanently removes the object and all its associated data. Here's an example of dropping a table:

# DROP TABLE employees;

ALTER: The ALTER statement is used to modify the structure of an existing database object. It allows you to add, modify, or delete columns, constraints, or other attributes of the object. Here's an example of altering a table:

In [ ]:
ALTER TABLE employees
ADD COLUMN email VARCHAR(100);

TRUNCATE: The TRUNCATE statement is used to delete all the data from a table while keeping its structure intact. Unlike the DROP statement, it does not remove the table itself. Here's an example of truncating a table:

TRUNCATE TABLE employees;

Q3

The structured query language (SQL) commands deal with the manipulation of data present in the database that belongs to the DML or Data Manipulation Language. This includes most of the SQL statements.

Examples of DML
The examples of DML in the Database Management System (DBMS) are as follows −

SELECT − Retrieve data from the database.

INSERT − Insert data into a table.

UPDATE − Update existing data within a table.

DELETE − Delete records from a database table.

Syntax for DML Commands
The syntax for the DML commands are as follows −

INSERT
Insert command is used to insert data into a table.

The syntax for insert command is as follows −

Syntax

Insert into <table_name> (column list) values (column values);
For example, if we want to insert multiple rows to the Employee table, we can use the following command −

Example

Insert into Employee(Emp_id, Emp_name) values (001, “ bhanu”);
Insert into Employee(Emp_id, Emp_name) values (002, “ hari”);
Insert into Employee(Emp_id, Emp_name) values (003, “ bob”);
SELECT
Select command is used to retrieve data from the database.

The syntax for the select command is as follows −

Syntax

SELECT * from <table_name>;
For example, if we want to select all rows from the Employee database, we can use the following command −

Example

SELECT * from Employee;
DELETE
Delete command is used to delete records from a database table.

The syntax for the delete command is as follows -

Syntax

 Delete from <table_name>WHERE condition;
For example, if we want to delete an entire row of employee id 002, we can use the following command −

Example

DELETE from Employee WHERE Emp_id=002;
UPDATE
Update command is used to update existing data within a table.

The syntax for the update command is as follows -

Syntax

UPDATE <table_name> SET column_number =value_number WHERE condition;
For example, if we want to update the name of the employee having the employee id 001, we can use the command given below −

Example

UPDATE Employee SET Emp_name= Ram WHERE Emp_id= 001;

Q4

Query languages, often known as DQLs or Data Query Languages, are computer languages that are used to make various queries in information systems and databases. The Structured Query Language (SQL) is a well-known example. DQL statements are used to query the data contained in schema objects.

In [ ]:
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10,2)
);
SELECT * FROM employees;
SELECT name, salary FROM employees;
SELECT * FROM employees WHERE salary > 5000;

Q5

A primary key is used to ensure data in the specific column is unique. A foreign key is a column or group of columns in a relational database table that provides a link between data in two tables

Q6

In [ ]:
import mysql.connector

# Establishing the connection
connection = mysql.connector.connect(
    host="your_host",
    user="your_username",
    password="your_password",
    database="your_database"
)

# Creating a cursor object
cursor = connection.cursor()

# Executing a query
query = "SELECT * FROM your_table"
cursor.execute(query)

# Fetching the results
results = cursor.fetchall()
for row in results:
    print(row)

# Closing the cursor and connection
cursor.close()
connection.close()
"""
cursor(): The cursor() method creates a cursor object that allows you to execute SQL statements and fetch results from the database. It is invoked on the database connection object.

execute(): The execute() method is used to execute an SQL statement or query. It is invoked on the cursor object. You pass the SQL query as a string parameter to the execute() method.
"""

Q7

In a typical SQL query, the clauses are executed in the following order:

1. FROM: The FROM clause specifies the table or tables from which the data is retrieved. It is executed first, identifying the data source.

2. WHERE: The WHERE clause is used to filter the data based on specified conditions. It is executed after the FROM clause, narrowing down the result set.

3. GROUP BY: The GROUP BY clause is used to group the rows in the result set based on one or more columns. It is executed after the WHERE clause and before the HAVING clause.

4. HAVING: The HAVING clause is used to filter the grouped data based on specified conditions. It is executed after the GROUP BY clause, further refining the result set.

5. SELECT: The SELECT clause is used to specify the columns to be retrieved from the result set. It is executed after the previous clauses, generating the final set of columns to be returned.

6. ORDER BY: The ORDER BY clause is used to sort the result set based on one or more columns. It is executed after the SELECT clause, arranging the rows in the desired order.

7. LIMIT/OFFSET: The LIMIT and OFFSET clauses are used to restrict the number of rows returned and specify the starting point for the result set. They are executed after all the previous clauses, finalizing the result set.

It's important to note that some clauses, such as GROUP BY, HAVING, and ORDER BY, may not be present in every SQL query. The clauses are executed sequentially, with each clause operating on the result of the previous clause, except for the SELECT clause, which specifies the final columns to be returned.